Revit 2026 API

# FailureMessageAccessorGetDefaultResolutionCaption Method

---

Retrieves the caption of default resolution of the failure.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string GetDefaultResolutionCaption()
```
```vb
Public Function GetDefaultResolutionCaption As String
```
```cpp
public:
String^ GetDefaultResolutionCaption()
```
```fsharp
member GetDefaultResolutionCaption : unit -> string
```

#### Return Value

String The caption of default resolution of the failure.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This FailureMessageAccessor has not been properly initialized. |

#### Reference

FailureMessageAccessor Class

Autodesk.Revit.DB Namespace